import { TestInfo } from "../components/TestPage";

// src/data/depressionTestData.ts
export const depressionTestData: TestInfo[] = [
 {
    id: 1,
    header: "Опитувальник з генералізованої тривоги - GAD-7",
    instruction: `Прочитайте тверждення нижче і оцініть, як часто протягом останніх двох тижнів Вас турбували будь-які з перерахованих проблем?`,
    questions: [
        { 
            id: 1, 
            number: 1,
            header: 'Ви нервували, відчували тривогу або були дуже напружені:',
            options: [
                'Ніколи',
                'Декілька днів',
                'Більшу половину часу',
                'Майже щодня'
            ] 
        },
        { id: 2, 
            number: 2,
            header: 'Ви не могли зупинити або контролювати своє хвилювання:',
            options: [
                'Ніколи',
                'Декілька днів',
                'Більшу половину часу',
                'Майже щодня'
            ] 
        },
        { 
            id: 3, 
            number: 3,
            header: 'Ви занадто хвилювались через різні речі:',
            options: [
                'Ніколи',
                'Декілька днів',
                'Більшу половину часу',
                'Майже щодня'
            ]
        },
        { 
            id: 4, 
            number: 4,
            header: 'Вам було важко розслабитись:',
            options: [
                'Ніколи',
                'Декілька днів',
                'Більшу половину часу',
                'Майже щодня'
            ]
        },
        {
            id: 5,
            number: 5,
            header: 'Ви були настільки неспокійні, що Вам було важко всидіти на одному місці:',
            options: [
                'Ніколи',
                'Декілька днів',
                'Більшу половину часу',
                'Майже щодня'
            ]
        },
        {
            id: 6,
            number: 6,
            header: 'Вам було легко дошкулити або роздратувати:',
            options: [
                'Ніколи',
                'Декілька днів',
                'Більшу половину часу',
                'Майже щодня'
            ]
        },
        {
            id: 7,
            number: 7,
            header: 'Ви відчували страх, неначе щось жахливе може статися:',
            options: [
                'Ніколи',
                'Декілька днів',
                'Більшу половину часу',
                'Майже щодня'
            ]
        }
            
    ],
}
]
