import { Question, QuestionOld, TestInfo, TestInfoOld } from "../components/TestPage";

// src/data/depressionTestData.ts
export const depressionTestDataOld: TestInfoOld[] = [
    {
        id: 1,
        header: "Опитувальник з генералізованої тривоги - GAD-7",
        instruction: `Прочитайте тверждення нижче і оцініть, як часто протягом останніх двох тижнів Вас турбували будь-які з перерахованих проблем?`,
        questions: [
            {
                id: 1,
                number: 1,
                header: 'Ви нервували, відчували тривогу або були дуже напружені:',
                options: [
                    'Ніколи',
                    'Декілька днів',
                    'Більшу половину часу',
                    'Майже щодня'
                ]
            },
            {
                id: 2,
                number: 2,
                header: 'Ви не могли зупинити або контролювати своє хвилювання:',
                options: [
                    'Ніколи',
                    'Декілька днів',
                    'Більшу половину часу',
                    'Майже щодня'
                ]
            },
            {
                id: 3,
                number: 3,
                header: 'Ви занадто хвилювались через різні речі:',
                options: [
                    'Ніколи',
                    'Декілька днів',
                    'Більшу половину часу',
                    'Майже щодня'
                ]
            },
            {
                id: 4,
                number: 4,
                header: 'Вам було важко розслабитись:',
                options: [
                    'Ніколи',
                    'Декілька днів',
                    'Більшу половину часу',
                    'Майже щодня'
                ]
            },
            {
                id: 5,
                number: 5,
                header: 'Ви були настільки неспокійні, що Вам було важко всидіти на одному місці:',
                options: [
                    'Ніколи',
                    'Декілька днів',
                    'Більшу половину часу',
                    'Майже щодня'
                ]
            },
            {
                id: 6,
                number: 6,
                header: 'Вам було легко дошкулити або роздратувати:',
                options: [
                    'Ніколи',
                    'Декілька днів',
                    'Більшу половину часу',
                    'Майже щодня'
                ]
            },
            {
                id: 7,
                number: 7,
                header: 'Ви відчували страх, неначе щось жахливе може статися:',
                options: [
                    'Ніколи',
                    'Декілька днів',
                    'Більшу половину часу',
                    'Майже щодня'
                ]
            }

        ],
        resultInfo: 'Важливо зазначити, що тест GAD-7 не є остаточною діагнозом і не може замінити професійну консультацію з лікарем-психіатром. Якщо ви маєте симптоми депресії, зверніться до свого лікаря або психотерапевта для отримання професійної допомоги.'
    },
    {
        id: 2,
        header: "Шкала депресії Бека",
        instruction: `Цей опитувальник складається з 21 пункту, кожен з яких містить кілька варіантів тверджень. Будь ласка, уважно прочитайте всі варіанти відповідей до кожного пункту і виберіть один з них, який найкраще описує Ваше самопочуття протягом останніх двох тижнів, включаючи сьогоднішній день. Натисніть (клікніть) на вибраному твердженні. Переконайтеся, що Ви не пропустили жодного пункту.`,
        questions: [
            {
                id: 1,
                number: 1,
                header: '',
                options: [
                    'Мені не сумно',
                    'Значну частину часу мені сумно',
                    'Я увесь час почуваюсь сумним, пригніченим',
                    'Я відчуваю нестерпний сум та тугу'
                ]
            },
            {
                id: 2,
                number: 2,
                header: '',
                options: [
                    'Я не вважаю, що заслуговую покарання',
                    'Я допускаю, що заслуговую покарання',
                    'Я вважаю, що маю бути покараний',
                    'Я відчуваю, що доля карає мене'
                ]
            },
            {
                id: 3,
                number: 3,
                header: '',
                options: [
                    'Я спокійно думаю про майбутнє',
                    'Думки про майбутнє викликають в мене занепокоєння більше, ніж раніше',
                    'Мені нема чого чекати від майбутнього і на що надіятися',
                    'Я відчуваю, що в моєму майбутньому нема нічого доброго і я нічого не можу змінити'
                ]
            },
            {
                id: 4,
                number: 4,
                header: '',
                options: [
                    'Я не відчуваю себе невдахою',
                    'В минулому я мав би менше зазнавати невдач',
                    'Моє життя – це суцільна низка невдач та помилок',
                    'Я абсолютний невдаха в усьому (навчанні, праці, сімейному житті і т.д.)'
                ]
            },
            {
                id: 5,
                number: 5,
                header: '',
                options: [
                    'Я в основному задоволений тим, ким я є',
                    'Я втратив впевненість у собі',
                    'Я розчарований в собі',
                    'Я не люблю себе'

                ]
            },
            {
                id: 6,
                number: 6,
                header: '',
                options: [
                    'Я отримую задоволення від улюблених занять і речей',
                    'Я не отримую такого задоволення, як раніше від улюблених занять та речей',
                    'Я отримую дуже мало задоволення від того, що зазвичай мене тішило',
                    'Я не можу отримати задоволення від того, що зазвичай мене тішило'
                ]
            },
            {
                id: 7,
                number: 7,
                header: '',
                options: [
                    'Я критикую і звинувачую себе не більше, ніж зазвичай',
                    'Я більш критичний до себе, ніж зазвичай',
                    'Я критикую себе за всі свої помилки',
                    'Я звинувачую себе у всьому поганому, що відбувається'
                ]

            },
            {
                id: 8,
                number: 8,
                header: '',
                options: [
                    'Я не відчуваю відчуття провини',
                    'Я відчуваю почуття провини за багато речей, зроблених мною',
                    'Я дуже часто чуюсь поганою людиною і мене мучить відчуття провини',
                    'Мене мучить постійне відчуття провини'
                ]
            },
            {
                id: 9,
                number: 9,
                header: '',
                options: [
                    'У мене не виникає думок про самогубство',
                    'У мене бувають думки про самогубство, але я знаю, що не зроблю цього',
                    'Я хочу вмерти і планую самогубство',
                    'Якщо б була нагода, я б зробив самогубство'
                ]
            },
            {
                id: 10,
                number: 10,
                header: '',
                options: [
                    'Я не більш неспокійний або збуджений, ніж зазвичай',
                    'Я відчуваю більше занепокоєння і збудження, ніж зазвичай',
                    'Я відчуваю таке занепокоєння і збудження, що мені важко сидіти спокійно',
                    'Я відчуваю таке занепокоєння і збудження, що змушений весь час рухатися або щось робити'
                ]
            },
            {
                id: 11,
                number: 11,
                header: '',
                options: [
                    'Я не плачу більш часто, ніж звичайно',
                    'Я плачу частіше, ніж звичайно',
                    'Я плáчу кожен день по кожному незначному приводу',
                    'Я хочу плакати, але не можу'
                ]
            },
            {
                id: 12,
                number: 12,
                header: '',
                options: [
                    'Я не втратив цікавості до інших людей і занять',
                    'Люди і речі цікавлять мене менше, ніж раніше.',
                    'Я значною мірою втратив цікавість до інших людей і занять',
                    'Мене важко чимось зацікавити'
                ]
            },
            {
                id: 13,
                number: 13,
                header: '',
                options: [
                    'Я не дратуюсь частіше, ніж звичайно',
                    'Я дратуюся легше, ніж звичайно',
                    'Я дратуюся значно легше, ніж звичайно',
                    'Я постійно відчуваю роздратування'
                ]
            },
            {
                id: 14,
                number: 14,
                header: '',
                options: [
                    'Мені не є важче, ніж звичайно приймати рішення',
                    'Тепер частіше, ніж раніше я зволікаю з прийняттям рішень',
                    'Мені дуже важко прийняти будь-яке рішення',
                    'Я не в стані приймати жодних рішень'
                ]
            },
            {
                id: 15,
                number: 15,
                header: '',
                options: [
                    'Мій апетит не змінився',
                    'Мій апетит дещо знижений у порівнянні зі звичайним',
                    'Мій апетит дещо підвищений в порівнянні зі звичайним',
                    'Мій апетит значно знижений в порівнянні з минулим',
                    'Мій апетит значно підвищений в порівнянні з минулим',
                    'У мене зовсім нема апетиту',
                    'Я постійно хочу їсти',
                ]
            },
            {
                id: 16,
                number: 16,
                header: '',
                options: [
                    'Я не відчуваю себе нікчемним',
 'Я не відчуваю себе таким же цінним і корисним, як завжди',
 'Я відчуваю себе менш цінним, ніж інші',
 'Я відчуваю себе повністю нікчемним'
                ]
            },
            {
                id: 17,
                number: 17,
                header: '',
                options: [
                    'Я так само добре можу зосередитися, як завжди',
                    'Я не можу так само добре зосередитися, як завжди',
                    'Мені важко довго утримувати увагу на чому-небудь',
                    'Я не можу зосередитися ні на чому'
                ]
            },
            {
                id: 18,
                number: 18,
                header: '',
                options: [
                    'Я так само енергійний, як зазвичай',
 'У мене менше енергії, ніж зазвичай',
 'У мене недостатньо енергії, щоб зробити багато чого з того, що потрібно',
 'У мене немає сил ні на що'
                ]
            },
            {
                id: 19,
                number: 19,
                header: '',
                options: [
                    'Я втомлююся не більш, ніж зазвичай',
                    'Я втомлююся значно легше, ніж раніше',
                    'Через втому я не можу виконувати багато звичних для мене справ',
                    'Через втому я не можу виконувати більшість звичних для мене справ'
                ]
            },
            {
                id: 20,
                number: 20,
                header: '',
                options: [
                    'Я сплю так само, як завжди',
                    'Я сплю дещо більше, ніж зазвичай',
                    'Я сплю дещо менше, ніж зазвичай',
                    'Я сплю значно більше, ніж зазвичай',
                    'Я сплю значно менше, ніж зазвичай',
                    'Я сплю більшу частину дня',
                    'Я буджуся на 1-2 години раніше, ніж звичайно і мені важко знову заснути',
                ]
            },
            {
                id: 21,
                number: 21,
                header: '',
                options: [
                    'Мій інтерес до статевого життя за останній час не зменшився',
                    'Статеве життя мене цікавить зараз менше, ніж звичайно',
                    'Мій інтерес до статевого життя значно зменшився',
                    'Я повністю втратив інтерес до статевого життя'
                ]
            }
        ],
        resultInfo: 'Важливо зазначити, що тест BDI не є остаточною діагнозом і не може замінити професійну консультацію з лікарем-психіатром. Якщо ви маєте симптоми депресії, зверніться до свого лікаря або психотерапевта для отримання професійної допомоги.'
    },
    {
        id: 3,
        header: "Тест на симптоми емоційно нестабільного розладу особистості",
        instruction: `
            Емоційно нестабільний розлад особистості включає безліч різноманітних симптомів, які тим чи іншим чином вказують на наявність цього психічного розладу. Проте, серйозність захворювання та його симптоми можуть сильно різнитися між собою.
            
            Цей тест включає результати попередніх досліджень, щоб забезпечити достовірність на надійність результатів щодо визначення симптомів емоційно нестабільного розладу особистості.
            
            Чи наявні у Вас симптоми емоційно нестабільного розладу? Для кожного наступного твердження вкажіть, наскільки Ви з ним погоджуєтеся.
        `,
        questions: [
            {
                id: 1,
                number: 1,
                header: 'Я постійно шукаю розваги та спілкування з іншими людьми з надією, що це допоможе мені почуватися краще.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 2,
                number: 2,
                header: 'Інколи у стресових ситуаціях мені здається, що думки в моїй голові належать не мені.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 3,
                number: 3,
                header: 'Я часто псував(-ла) своє майно або цінні для мене речі, бо відчував(-ла), що не заслуговую їх.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 4,
                number: 4,
                header: 'У мене було багато найкращих друзів, які здавалися «на все життя» і з якими я більше (або майже) не спілкуюся.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 5,
                number: 5,
                header: 'Люди часто наголошували на тому, що їм складно зрозуміти мої емоції та вчинки.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 6,
                number: 6,
                header: 'Я часто спочатку вважаю людей ідеальними, а потім розчаровуюся у них.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 7,
                number: 7,
                header: 'Коли в результаті своїх дій, я потрапляю у неприємні ситуації, я приймаю негативні наслідки як належне, хоча ймовірно я б міг/могла уникнути їх.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 8,
                number: 8,
                header: 'У моєму житті є люди, яким я буду довіряти, незважаючи ні на що.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 9,
                number: 9,
                header: 'У мене часто траплявся незахищений секс.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 10,
                number: 10,
                header: 'Мене часто називали емоційною людиною.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 11,
                number: 11,
                header: 'Я часто говорю або дію, попередньо не подумавши.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 12,
                number: 12,
                header: 'Я постійно боюся, що друзі, родичі і/чи моя друга половинка покинуть мене.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 13,
                number: 13,
                header: 'У моєму колі друзів є багато людей, які завдали б мені шкоди, якби я не знав(-ла) їхніх таємниць.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 14,
                number: 14,
                header: 'У певні моменти свого життя я благав(-ла) людей, щоб вони не покидали мене, і робив(-ла) все, щоб втримати їх.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 15,
                number: 15,
                header: 'Я лякав(-ла) інших людей, що скою суїцид.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 16,
                number: 16,
                header: 'Я зустрічав(-ла) людей, які здавалися мені ідеальними, а потім я несподівано руйнував(-ла) з ними стосунки.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 17,
                number: 17,
                header: 'Мені важко контролювати свій шопінг та витрати.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 18,
                number: 18,
                header: 'У певні моменти свого життя я фізично не пускав(-ла) людину покинути мене.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 19,
                number: 19,
                header: 'У мене часто вкрай вузький погляд на речі, для мене або «все добре», або «все погано».',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 20,
                number: 20,
                header: 'Я часто інтерпретував(-ла) невинні зауваження як агресивні випади в мою сторону.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
            {
                id: 21,
                number: 21,
                header: 'У моєму колі друзів є багато людей, яким я не довіряю, хоча вони ніколи не підводили мене.',
                options: [
                    'Не згоден',
                    'Частково не згоден',
                    'Частково згоден',
                    'Згоден'
                ]
            },
                {
                    id: 22,
                    number: 22,
                    header: 'Мені стає некомфортно, коли у мене немає вказівок чи підказок від інших, які б мене скеровували.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 23,
                    number: 23,
                    header: 'Інколи, щоб розвеселити чи роздратувати мене, достатньо лише однієї дрібнички.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 24,
                    number: 24,
                    header: 'Я часто неправильно трактував(-ла) мотиви інших.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 25,
                    number: 25,
                    header: 'У мене були токсичні та напружені суперечки з більшістю близьких мені людей.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 26,
                    number: 26,
                    header: 'В один момент я можу захоплюватися собою, а в інший вважати себе невдахою.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 27,
                    number: 27,
                    header: 'У мене було багато партнерів, які здавалися «на все життя» і з якими я більше (або майже) не спілкуюся.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 28,
                    number: 28,
                    header: 'У моєму житті є люди, які бачать лише найгірше в мені, тому що вони не люблять мене бажають мені зла.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 29,
                    number: 29,
                    header: 'Я зазвичай оцінюю себе на основі суджень інших про мене.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 30,
                    number: 30,
                    header: 'Мене часто переповнюють мої емоції.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 31,
                    number: 31,
                    header: 'У мене бувають моменти, коли я відчуваю лише суцільну порожнечу всередині.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 32,
                    number: 32,
                    header: 'У мене всередині є порожнеча, яку неможливо заповнити.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 33,
                    number: 33,
                    header: 'Я часто не маю ані найменшого поняття, хто я.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 34,
                    number: 34,
                    header: 'В один момент я можу відчувати радість, а в іншу безпорадність, злість і біль.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 35,
                    number: 35,
                    header: 'Я навмисно завдаю шкоду власному здоров’ю (порізи, опіки, переїдання, голодування), коли я не можу впоратися з тим, що відбувається у мене в житті.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 36,
                    number: 36,
                    header: 'Люди в моєму житті придумали хитрі методи принижувати мене.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 37,
                    number: 37,
                    header: 'Я навмисно завдавав(-ла) собі фізичного болю, щоб почуватися краще.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 38,
                    number: 38,
                    header: 'Я часто міняв(-ла) роботу, друзів, цілі та партнерів у своєму житті.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 39,
                    number: 39,
                    header: 'Я постійно переїдаю (або голодую) в результаті внутрішніх переживань та негативних емоцій.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 40,
                    number: 40,
                    header: 'Інколи коли я сильно хвилююся, я втрачаю зв’язок з реальністю.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 41,
                    number: 41,
                    header: 'У мене бувають періоди, коли я зловживаю алкоголем і/чи наркотиками.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 42,
                    number: 42,
                    header: 'Мені здається, що щось дуже погане трапилося зі мною в дитинстві, і я не можу пригадати що саме.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 43,
                    number: 43,
                    header: 'У мене проблеми з переїданням.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 44,
                    number: 44,
                    header: 'У відносинах я постійно перепитую свою другу половинку, чи вона ще любить мене.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 45,
                    number: 45,
                    header: 'Я часто не можу зрозуміти, хто я і ким я хочу бути.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 46,
                    number: 46,
                    header: 'У моєму житті є люди, які бачать лише найкраще в мені, тому що вони люблять мене бажають мені добра.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 47,
                    number: 47,
                    header: 'Коли я стикаюся з поганими наслідками своїх дій, інколи мені здається, що це був хтось інший, хто допустив ті помилки.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 48,
                    number: 48,
                    header: 'У мене бувають моменти, коли я відчуваю безпорадність та абсурдність свого буття.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 49,
                    number: 49,
                    header: 'Люди, які викреслили мене з свого життя або яких викреслив(-ла) я, - погані.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                },
                {
                    id: 50,
                    number: 50,
                    header: 'Лише думка про те, що мене покинуть, викликає в мене дуже сильні негативні емоції, які мені важко пояснити.',
                    options: [
                        'Не згоден',
                        'Частково не згоден',
                        'Частково згоден',
                        'Згоден'
                    ]
                }
        ]
    }, 
    {
        id: 4,
        header: "Опитувальник для виявлення панічних атак",
        instruction: "ПРОЧИТАЙТЕ УВАЖНО\n\nЧитайте кожне твердження і вирішуйте, чи згодні Ви з ним або не згодні, натискаючи на: \"Так\" або \"Ні\". Уважно прочитайте всі твердження і дайте відповідь на них.\n\nПоставтеся до роботи серйозно і уважно, так як недбалість і прагнення спотворити результат призводить до недостовірності дослідження\n\n",
        questions: [
            {
                id: 1,
                number: 1,
                header: "чи відчували Ви приступи (атаки) раптової тривоги, страху або жаху протягом останніх 4 тижнів?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 2,
                number: 2,
                header: "чи були у Вас подібні приступи коли-небудь раніше?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 3,
                number: 3,
                header: "чи виникають деякі з цих приступів несподівано, в ситуаціях, де Ви не відчували занепокоєння або дискомфорту?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 4,
                number: 4,
                header: "чи маєте Ви острах приступу або його наслідків?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 5,
                number: 5,
                header: "під час Вашого останнього приступу (атаки) чи Ви відчували поверхневе, прискорене дихання?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 6,
                number: 6,
                header: "чи відчували Ви серцебиття, пульсацію, перебої в роботі серця або відчуття його зупинки?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 7,
                number: 7,
                header: "чи відчували Ви біль або дискомфорт у лівій половині грудної клітини?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 8,
                number: 8,
                header: "чи відчували Ви пітливість?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 9,
                number: 9,
                header: "чи відчували Ви нестачу повітря, задишку?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 10,
                number: 10,
                header: "чи відчували Ви хвилі жару або холоду?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 11,
                number: 11,
                header: "чи відчували Ви нудоту, дискомфорт в шлунку, пронос або позиви до нього?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 12,
                number: 12,
                header: "чи відчували Ви запаморочення, нестійкість, туман в голові або переднепритомний стан?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 13,
                number: 13,
                header: "чи відчували Ви поколювання або оніміння в тілі або кінцівках?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 14,
                number: 14,
                header: "чи відчували Ви тремтіння в тілі, кінцівках, посмикування або стягування тіла (кінцівок)?",
                options: [
                    "Так",
                    "Ні"
                ]
            },
            {
                id: 15,
                number: 15,
                header: "чи відчували Ви страх смерті або незворотних наслідків нападу?",
                options: [
                    "Так",
                    "Ні"
                ]
            }
        ],
        resultInfo: 'Важливо зауважити, що цей тест не є остаточним діагнозом і не може замінити професійну консультацію з лікарем-психіатром. Якщо у вас є підозра на панічні атаки, рекомендується звернутися до фахівця для отримання правильної діагностики та лікування.'
    },
    {
        id: 5,
        header: "Тест на симптоми РДУГ",
        instruction: "Тест на РДУГ включає безліч різних симптомів, які в той чи інший спосіб вказують на наявність цього психічного розладу. Однак, серйозність захворювання та його симптоми можуть сильно відрізнятися між собою.",
        questions: [
            {
                id: 1,
                number: 1,
                header: "Я часто втрачаю такі речі, як гаманець, ключі, телефон, важливі документи тощо.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 2,
                number: 2,
                header: "Мені важко регулярно виконувати свої обов'язки та/або вчасно оплачувати рахунки.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 3,
                number: 3,
                header: "Мені важко впоратися зі своїми помилками та/або незнайомими мені проблемами.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 4,
                number: 4,
                header: "Мені завжди важко чекати своєї черги.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 5,
                number: 5,
                header: "У дитинстві мені було важко виконувати вправи на рівновагу, наприклад, гімнастику.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 6,
                number: 6,
                header: "У дитинстві я часто потрапляв у безглузді ситуації.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 7,
                number: 7,
                header: "Я часто не доводжу справу до кінця, коли хтось каже мені зробити щось певним чином.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 8,
                number: 8,
                header: "Мені важко залишатися зосередженим протягом тривалого часу.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 9,
                number: 9,
                header: "Я часто відчуваю розчарування та/або нерозуміння.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 10,
                number: 10,
                header: "У дитинстві я був надто активним або пасивним через вплив яскравого світла, гучних звуків або інших подразників.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 11,
                number: 11,
                header: "Я часто забуваю про дедлайни або важливі дати.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 12,
                number: 12,
                header: "Я часто не можу всидіти на місці.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 13,
                number: 13,
                header: "Коли я злюся, я легко стаю агресивним, словесно і фізично.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 14,
                number: 14,
                header: "Я часто не звертаю уваги на деталі.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 15,
                number: 15,
                header: "Іноді я можу щось ляпнути, навіть не знаючи, що я сказав і чому.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 16,
                number: 16,
                header: "Навіть дуже важливі зустрічі можуть вилетіти з голови.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 17,
                number: 17,
                header: "Мені часто казали, що я надто багато говорю.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 18,
                number: 18,
                header: "У мене бувають дні, коли майже все діє мені на нерви.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 19,
                number: 19,
                header: "Мені важко довго залишатися на одному місці.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 20,
                number: 20,
                header: "Мої думки часто блукають під час розмов та/або лекцій.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 21,
                number: 21,
                header: "Мої думки і почуття часто заважають мені досягти успіху в школі або на роботі.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 22,
                number: 22,
                header: "Іноді я дуже хвилююся.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 23,
                number: 23,
                header: "Я ловлю себе на тому, що уникаю завдань та обов'язків, з якими у мене можуть виникнути труднощі.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 24,
                number: 24,
                header: "Інші люди були неодноразово здивовані або шоковані моїми непередбачуваними вчинками.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 25,
                number: 25,
                header: "У дитинстві я мав труднощі із заняттями, які вимагали навичок координації.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 26,
                number: 26,
                header: "Мені потрібно багато часу, щоб заспокоїтися після емоційного струсу.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 27,
                number: 27,
                header: "Люди часто очікують, що я знаю чи розумію речі, які здаються мені дивними чи безглуздими.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 28,
                number: 28,
                header: "У дитинстві мої батьки та/або вчителі були стурбовані темпом, з яким я вчився говорити.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 29,
                number: 29,
                header: "Інші казали мені, що маю звичку влазити в чужі розмови чи справи.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 30,
                number: 30,
                header: "Я постійно неспокійно верчуся в кріслі.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 31,
                number: 31,
                header: "Я дуже легко відволікаюсь.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 32,
                number: 32,
                header: "Я часто забуваю про доручення та домашні справи.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 33,
                number: 33,
                header: "У дитинстві мені було важко навчитися застібати одяг та зав'язувати шнурки.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 34,
                number: 34,
                header: "Коли я думаю, що завдання занадто складне або заплутане для мене, я часто здаюся.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            },
            {
                id: 35,
                number: 35,
                header: "Я часто перемикаюся з одного заняття на інше.",
                options: [
                    "Не згоден",
                    "Частково не згоден",
                    "Частково згоден",
                    "Згоден"
                ]
            }
        ]
    },
    {
        id: 6,
        header: "Шкала Йеля-Брауна для оцінки симптомів ОКР",
        instruction: "Уважно прочитайте кожне твердження і виберіть одну відповідь, яка найбільш точно відповідає вашому стану. Після заповнення опитувальника натисніть на кнопку Обробити.",
        questions: [
            {
                id: 1,
                number: 1,
                header: "Загальна тривалість Ваших нав'язливих думок (обсесій) протягом доби становить:",
                options: [
                    "не спостерігаються взагалі",
                    "за сукупністю менше години",
                    "за сукупністю 1-3 години протягом дня",
                    "за сукупністю 3-8 годин протягом дня",
                    "за сукупністю більше 8 годин протягом дня"
                ]
            },
            {
                id: 2,
                number: 2,
                header: "Ступінь порушення повсякденного життя внаслідок наявності нав'язливих думок:",
                options: [
                    "зовсім не порушена",
                    "порушена слабо",
                    "відчувається негативний вплив, але спосіб життя колишній",
                    "сильно порушений повсякденний спосіб життя",
                    "образ життя повністю порушений"
                ]
            },
            {
                id: 3,
                number: 3,
                header: "Рівень психологічного дискомфорту внаслідок нав'язливих думок:",
                options: [
                    "не відчуваю взагалі",
                    "відчуваю слабкий дискомфорт",
                    "відчуваю сильний дискомфорт, але в загальному, відчуваю себе добре",
                    "відчуваю сильний дискомфорт і це позначається на моє самопочутті",
                    "практично весь день відчуваю дуже сильний дискомфорт"
                ]
            },
            {
                id: 4,
                number: 4,
                header: "Опір обсессії (нав'язливим думкам):",
                options: [
                    "в стані їм чинити опір практично завжди",
                    "можу чинити опір більшій частині обсесій",
                    "іноді я можу надати їм гарний опір",
                    "частіше за все я не можу опиратися їм",
                    "не в змозі чинити опір обсесії"
                ]
            },
            {
                id: 5,
                number: 5,
                header: "Ступінь контролю над обсесіями (нав'язливими думками):",
                options: [
                    "обсесії повністю знаходяться під моїм контролем",
                    "в більшості випадків я контролюю їх",
                    "іноді мені вдається контролювати обсесії",
                    "можу контролювати їх незначним чином",
                    "мої обсесії неконтрольовані"
                ]
            },
            {
                id: 6,
                number: 6,
                header: "Ваша тривалість нав'язливих дій, ритуалів (компульсії) протягом доби:",
                options: [
                    "не спостерігається взагалі",
                    "за сукупністю менше години",
                    "за сукупністю 1-3 години протягом дня",
                    "за сукупністю 3-8 годин протягом дня",
                    "за сукупністю більше 8 годин протягом дня"
                ]
            },
            {
                id: 7,
                number: 7,
                header: "Ступінь порушення образу повсякденного життя:",
                options: [
                    "зовсім не порушений",
                    "чинять слабкий вплив",
                    "відчувається негативний вплив, але спосіб життя не змінився",
                    "сильно порушують повсякденний спосіб життя",
                    "спосіб життя повністю порушений"
                ]
            },
            {
                id: 8,
                number: 8,
                header: "Рівень психологічного дискомфорту:",
                options: [
                    "не відчуваю взагалі",
                    "відчуваю слабкий дискомфорт",
                    "відчуваю сильний дискомфорт, але у загальному, відчуваю себе добре",
                    "відчуваю сильний дискомфорт і це позначається на моєму самопочутті",
                    "практично весь день відчуваю дуже сильний дискомфорт"
                ]
            },
            {
                id: 9,
                number: 9,
                header: "Опір компульсії (нав'язливим діям, ритуалам):",
                options: [
                    "в стані їм чинити опір практично завжди",
                    "можу чинити опір більшості компульсій",
                    "іноді я можу надати їм гарний опір",
                    "найчастіше я не можу опиратися їм",
                    "не в змозі чинити опір компульсії"
                ]
            },
            {
                id: 10,
                number: 10,
                header: "Ступінь контролю над компульсіями:",
                options: [
                    "компульсії повністю знаходяться під моїм контролем",
                    "в більшості випадків я контролюю їх",
                    "іноді мені вдається контролювати компульсії",
                    "можу контролювати їх незначним чином",
                    "мої компульсії неконтрольовані"
                ]
            }
        ],
        resultInfo: 'Зверніть увагу, що цей тест не є остаточною діагнозом і не може замінити професійну консультацію з лікарем-психіатром.'
    }
    
    
    
]


//parse TestInfoOld -> TestInfo

export const allTestData = (): TestInfo[] => {
    const testInfoOld: TestInfoOld[] = depressionTestDataOld;
    let testInfo: TestInfo[] = [];
    testInfoOld.forEach((el: TestInfoOld) => {
        let questions: Question[] = [];
        let newEl: TestInfo = {
            id: el.id,
            header: el.header,
            instruction: el.instruction,
            questions: [],
            resultInfo: el.resultInfo ? el.resultInfo : ''
        };
        //parse questions
        el.questions.forEach((q: QuestionOld) => {
            let newQ: Question = {
                id: q.id,
                number: q.number,
                header: q.header,
                options: []
            };
            //parse options
            q.options.forEach((opt: string, index: number) => {
                if (el.id == 4) {
                    if (opt == 'Так')
                        newQ.options.push({text: opt, point: 1});
                    else
                        newQ.options.push({text: opt, point: 0});

                } else {
                    newQ.options.push({text: opt, point: index});
                }
            });
            questions.push(newQ);
        });
        newEl.questions = questions;
        testInfo.push(newEl);
        
    });
    console.log('testInfo', testInfo);
    return testInfo;
};


export const analyseScore = (testId: number, score: number): string => {
    if (testId === 1) {
//         0-4 — мінімальна тривога
// 5-9 — легка тривога
// 10-14 — помірне занепокоєння
// 15-21 — сильна тривога
        if (score <= 4) {
            return 'Мінімальна тривога';
        } else if (score <= 9) {
            return 'Легка тривога';
        } else if (score <= 14) {
            return 'Помірне занепокоєння';
        } else if (score <= 21) {
            return 'Сильна тривога';
        }
    }

    if (testId === 2) {
//         🔴Шкала депресії Бека

// 0-9 — відсутність депресивних симптомів
// 10-15 — легка депресія (субдепресія)
// 16-19 — помірна депресія
// 20-29 — виражена депресія (середньої тяжкості)
// 30-63 — важка депресія
        if (score <= 9) {
            return 'Відсутність депресивних симптомів';
        } else if (score <= 15) {
            return 'Легка депресія (субдепресія)';
        } else if (score <= 19) {
            return 'Помірна депресія';
        } else if (score <= 29) {
            return 'Виражена депресія (середньої тяжкості)';
        } else if (score <= 63) {
            return 'Важка депресія';
        }
    }
    if (testId == 6) {
//         0—7 -Субклінічний стан
// 8-15 -Легкий ступінь вираженості симптомів ОКР 
// 16—23 —Середньої ступінь  вираженості симптомів ОКР 
// 24-31 —Тяжкий ступінь вираженості симптомів ОКР 
// 32 - 40 —Дуже тяжкий ступінь вираженості симптомів ОКР
        if (score <= 7) {
            return 'Субклінічний стан';
        } else if (score <= 15) {
            return 'Легкий ступінь вираженості симптомів ОКР';
        } else if (score <= 23) {
            return 'Середньої ступінь  вираженості симптомів ОКР';
        } else if (score <= 31) {
            return 'Тяжкий ступінь вираженості симптомів ОКР';
        } else if (score <= 40) {
            return 'Дуже тяжкий ступінь вираженості симптомів ОКР';
        }
    }

    if (testId == 4) {
        //0-3 низький ризик 
        //4-7 середній ризик 
        //8-11 високий ризик

        if (score <= 3) {
            return 'Низький ризик';
        } else if (score <= 7) {
            return 'Середній ризик';
        } else if (score <= 11) {
            return 'Високий ризик';
        }
    }
    return '';
}



